# -------------------------------------------------------------------------------------------------------------------------------------------------------
# 1.	Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет


# print('Enter a number:')

# a = int(input())

# if a > 5:
#     print('this day is a weekend')
# else:
#     print('This day is not a weekend') 


# if a > 7:
#     print('Incorrect number')

# -------------------------------------------------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------------------------------------------------------------------------------------------------------

# 1.	Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

#                                                       НЕ СДЕЛАЛ

# --------------------------------------------------------------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------------------------------------------------------------

# 2.	Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3


# x = int(input('Enter x coordinate: '))
# y = int(input('Enter y coordinate: '))


# if x > 0 and y > 0:
#     print('First quarter')
# if x < 0 and y > 0:
#     print('Second quarter')
# if x < 0 and y < 0:
#     print('Third quarter')
# if x > 0 and y < 0:
#     print('Foutrh quarter')

# ----------------------------------------------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------------------------------------------

# 1.	Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).


# n = int(input('Input quarter number: '))

# if n < 1 or n > 4:
#     print('Incorrect number')
# elif n == 1:
#     print('x > 0 and y > 0')
# elif n == 2:
#     print('x < 0 and y > 0')
# elif n == 3:
#     print('x < 0 and y < 0')
# elif n == 4:
#     print('x > 0 and y < 0')
    

# ----------------------------------------------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------------------------------------------


# 2.	Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21


# print('Input A coordinates: ')
# xA = float(input('xA: '))
# yA = float(input('yA: '))

# print('Input B coordinates: ')

# xB = float(input('xB: '))
# yB = float(input('yB: '))


# import math
# print('Distance between two points: ', (xB - xA)**2 + (yB - yA)**2)

# Вроде работает, получаетя 26, а корень из 26 как раз и будет 5 с чем то. Проверил на цифрах из примера. Вот только корень не получается извлечь. 
# Применил math.sqrt(xB - xA)**2 + (yB - yA)**2)

# ----------------------------------------------------------------------------------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------------------------------------------





















































































